app/controllers/books_controller.rb

  def index
    @books = Book.all
---
SELECT "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def create
    @book = Book.new(book_params)

    if @book.save
---
INSERT INTO "books" ("title", "category", "created_at", "updated_at", "img") VALUES (?, ?, ?, ?, ?)  [["title", "海の幸グルメガイド"], ["category", "PHP"], ["created_at", "2020-05-09 11:46:31.114401"], ["updated_at", "2020-05-09 11:46:31.114401"], ["img", "51f23L-IPPL._SX338_BO1_204_203_200_.jpg"]]